Revit 2026 API

# DefinitionsItem Property

---

Retrieves a definition by a given name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Definition this[
	string name
] { get; }
```
```vb
Public ReadOnly Property Item (
	name As String
) As Definition
	Get
```
```cpp
public:
property Definition^ Item[String^ name] {
	Definition^ get (String^ name);
}
```
```fsharp
member Item : Definition with get
```

#### Parameters

name String
    The name of the parameter definition for which to search.

#### Property Value

Definition

If the definition is not found then  will be returned.

#### Reference

Definitions Class

Autodesk.Revit.DB Namespace